In [17]:
import pandas as pd
import numpy as np

In [84]:
d1 = pd.DataFrame()
d2 = pd.DataFrame()

In [95]:
d1['a1'] = np.random.randint(1, 100, 5)
d1['a2'] = np.random.randint(1, 100, 5)
d1['a3'] = np.random.randint(1, 100, 5)
d1['a4'] = [1, 99, 100, 2, np.nan]

d2['a1'] = np.random.randint(1, 100, 5)
d2['a2'] = np.random.randint(1, 100, 5)
d2['a3'] = np.random.randint(1, 100, 5)
d2['a4'] = np.random.randint(1, 100, 5)

In [96]:
d1_np = d1.to_numpy()
d2_np = d2.to_numpy()

In [97]:
d1

   a1  a2  a3     a4
0  79  35  55    1.0
1  89  47  12   99.0
2  27  55  55  100.0
3  59  23  21    2.0
4  41   2  59    NaN

In [98]:
d2

   a1  a2  a3  a4
0   2  86  42  67
1  32  73   8  27
2  78  85  84  63
3  61  45  42  10
4  76  11  16  59

In [99]:
np.where(d1_np >= d2_np, d2_np, (np.where(d1_np < d2_np, d1_np, 999)))

array([[  2.,  35.,  42.,   1.],
       [ 32.,  47.,   8.,  27.],
       [ 27.,  55.,  55.,  63.],
       [ 59.,  23.,  21.,   2.],
       [ 41.,   2.,  16., 999.]])

In [81]:
df = pd.DataFrame(np.where(d1_np >= d2_np, d2_np, (np.where(d1_np < d2_np, d1_np, 999))), columns=['new_co1', 'new_col2', 'new_col3'])

In [82]:
df

   new_co1  new_col2  new_col3
0       74         7        52
1       46        11         9
2        9        10        29
3       48        11        94
4       40        62         7
5       37        23        10
6       37        32         9
7       49         3        48
8       36        11        52
9       29        13        42